{
  "rooms": [
    {
      "id": 1,
      "name": "Home",
      "longDescription": "You are in your small and cozy home. The bed is soft and inviting, \nbut the alarm clock is going off, signaling the start of a new day. \nWaking up with a refreshed mind, you start getting ready for the day. \nYou brush your teeth, get dressed, and enjoy some light breakfast and coffee. \nDon't forget to collect all your necessary items before leaving the house!",
      "shortDescription": "You wake up and start to get ready for the day after collecting all your necessary items.",
      "connections": [
        {
          "direction": "s",
          "roomID": 2
        }
      ]
    },
    { 
      "id": 2,
      "name": "Jeremy's Bakery",
      "longDescription": "Starting off bright and early in the morning, you are asked urgently by \nthe owner of the local Bake Goods shop if you can help them pick up some \nlast-minute groceries for a big order as one of their workers fell sick. \nYou were provided a list, but as someone who barely ever made dessert, \nthe task seemed a bit harder than how you had imagined. What problem would \nyou have to solve in order to finish the task in time for the bakers to \nstart making their order?",
      "shortDescription": "You're in the town's Baked Goods shop. The owner Jeremy has asked for \nyour help in some last-minute shopping for a big order, but the task list \nturns out to be more complicated than it seems.",
      "connections": [
        {
          "direction": "w",
          "roomID": 3
        },
        {
          "direction": "e",
          "roomID": 7
        }
      ]
    },
    { 
      "id": 3,
      "name": "Florence's Flower Shop",
      "longDescription": "You are in a flower shop. The walls are lined with shelves adorned with \nvibrant blooms. In the center, a large wooden table is strewn with sharp \nshears, spools of twine, and rolls of wrapping paper. Behind the table, \nFlorence, the florist, moves with frantic purpose. Nearby, a chalkboard \ndisplays a large order with scratched-out ideas and half-erased notes.",
      "shortDescription": "You are in a flower shop. A frantic florist crafts arrangements at a cluttered table.",
      "connections": [
        {
          "direction": "e",
          "roomID": 2
        },
        {
          "direction": "s",
          "roomID": 5
        },
        {
          "direction": "se",
          "roomID": 6
        }
      ]
    },
    {
      "id": 4,
      "name": "Dina's Diner",
      "longDescription": "You are in Dina's Diner, the neighborhood restaurant. The aroma of \nfreshly brewed coffee mingles with the sweet scent of pie cooling in \nthe back. The classic checkerboard floors feels like a nostalgic trip \nback in time and the red vinyl booths invite you to sink in. \nBehind the counter, you spot Dina, scurrying around as if searching for something.",
      "shortDescription": "You are in Dina's Diner, the neighborhood restaurant. The owner \nscurries around looking for something.",
      "connections": [
        {
          "direction": "n",
          "roomID": 8
        },
        {
          "direction": "e",
          "roomID": 7
        }
      ]
    },
    {
      "id": 5,
      "name": "Lore Library",
      "longDescription": "You are in Lore Library. Towering shelves stretch from front to back, \nbrimming with centuries of knowledge and boundless imagination. \nThe inviting atmosphere encourages you to explore the countless stories waiting \nto be discovered. The quiet ambiance enhances the serenity of the space, \nmaking it a perfect haven for readers and dreamers alike. Near the front \ndoor, Mrs. Henderson, the librarian, expertly assists those seeking a specific title.",
      "shortDescription": "You are in Lore Library. Mrs. Henderson, the librarian, skillfully helps \nvisitors find the titles they're looking for.",
      "connections": [
        {
          "direction": "n",
          "roomID": 3
        },
        {
          "direction": "e",
          "roomID": 6
        }
      ]
    },
    {
      "id": 6,
      "name": "Neighbour's House",
      "longDescription": "You are in the Smiths' house. The Smiths are a charming elderly couple. \nYou often check-in with them in case they need any help. Today, they've \nkindly invited you over for some afternoon tea. Everyone decides to sit \noutside to enjoy the nice breeze and smell of nice tea and freshly \nbaked cookies Mrs. Smith made.",
      "shortDescription": "You are in the Smiths' house for some afternoon tea.",
      "connections": [
        {
          "direction": "w",
          "roomID": 5
        },
        {
          "direction": "s",
          "roomID": 8
        }
      ]
    },
    {
      "id": 7,
      "name": "Retirement Home",
      "longDescription": "You are in Riverside Retirement Homes. The lobby is warm and welcoming, \nwith the gentle hum of an old radio playing classic tunes from the 50s. \nResidents sit together in small clusters chatting softly, while a \ncaretaker passes by with a friendly smile. You see Grandma Sophia \nknitting alone in front of the television.",
      "shortDescription": "You are in Riverside Retirement Homes. Grandma Sophia sits alone, \nknitting quietly in front of the television.",
      "connections": [
        {
          "direction": "s",
          "roomID": 4
        },
        {
          "direction": "w",
          "roomID": 2
        }
      ]
    },
    {
      "id": 8,
      "name": "The Park",
      "longDescription": "You are in Perennial Park, surrounded by a lush canopy of trees and \nthe sound of rustling leaves.Your attention is drawn to soft whimpering. \nA small dog cowers behind a tree. You recognize him. It's Mrs. Davis' dog, Max.",
      "shortDescription": "You are in Perennial Park. Here's where you found Max, \nMrs. Davis's dog.",
      "connections": [
        {
          "direction": "n",
          "roomID": 6
        },
        {
          "direction": "s",
          "roomID": 4
        }
      ]
    }
  ]
}